barsgl/barsgl-ejbparent/barsgl-ejbtest/src/test/resources/AccountDetailsNotifyFcc6Close.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gbo="urn:ucbru:gbo:v5"
                  xmlns:acc="urn:ucbru:gbo:v5:acc">
    <soapenv:Header>
        <NS1:UCBRUHeaders xmlns:NS1="urn:ucbru:gbo:v5">
            <NS1:Audit>
                <NS1:MessagePath>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.v5.AcDeNo.NotificationHandler</NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-22T14:13:42.032+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>START</NS1:RoutingRole>
                        <NS1:Comment>Start of message processing</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.AccountListQuery.RequestHandler</NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-22T14:13:42.044+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>START</NS1:RoutingRole>
                        <NS1:Comment>Start of message processing</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.MasterAccountPositioningBatchQuery.RequestHandler
                        </NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-22T14:13:42.076+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>START</NS1:RoutingRole>
                        <NS1:Comment>Start of message processing</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.MasterAccountPositioningBatchQuery.RequestHandler
                        </NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-22T14:13:42.105+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>ROUTE</NS1:RoutingRole>
                        <NS1:Comment>In the cache of the accounts not detected, will be requested ABS</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.MasterAccountPositioningBatchQuery.ABSRequestHandler
                        </NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-22T14:13:42.119+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>START</NS1:RoutingRole>
                        <NS1:Comment>Start of message processing</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.MasterAccountPositioningBatchQuery.ABSRequestHandler
                        </NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-22T14:13:42.126+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>ROUTE</NS1:RoutingRole>
                        <NS1:Comment>Routing by cache settings</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.MasterAccountPositioningBatchQuery.ABSResponseHandler
                        </NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-22T14:13:42.190+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>ROUTE SUCCESS</NS1:RoutingRole>
                        <NS1:Comment>The responses received from ECHO,FCC</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.MasterAccountPositioningBatchQuery.ABSResponseHandler
                        </NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-22T14:13:42.194+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>SUCCESS</NS1:RoutingRole>
                        <NS1:Comment>Finish of message processing</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.MasterAccountPositioningBatchQuery.ResponseHandler
                        </NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-22T14:13:42.204+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>SUCCESS</NS1:RoutingRole>
                        <NS1:Comment>Finish of message processing</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.AccountListQuery.ABSRouter</NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-22T14:13:42.214+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>ROUTE</NS1:RoutingRole>
                        <NS1:Comment>Routing by cache settings</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.AccountListQuery.ResponseHandler</NS1:Application.Module>
                        <NS1:VersionId>5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-22T14:13:42.341+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>ROUTE SUCCESS</NS1:RoutingRole>
                        <NS1:Comment>The responses received from ECHO,FCC</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.AccountListQuery.ResponseHandler</NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-22T14:13:42.346+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>SUCCESS</NS1:RoutingRole>
                        <NS1:Comment>Finish of message processing</NS1:Comment>
                    </NS1:Step>
                    <NS1:Step>
                        <NS1:Application.Module>SACC.v5.AcDeNo.PublishHandler</NS1:Application.Module>
                        <NS1:VersionId>v5</NS1:VersionId>
                        <NS1:TimeStamp>2017-11-22T14:13:42.359+03:00</NS1:TimeStamp>
                        <NS1:RoutingRole>SUCCESS</NS1:RoutingRole>
                        <NS1:Comment>Finish of message processing</NS1:Comment>
                    </NS1:Step>
                </NS1:MessagePath>
            </NS1:Audit>
        </NS1:UCBRUHeaders>
    </soapenv:Header>
    <soapenv:Body>
        <acc:AccountList>
            <acc:AccountDetails>
                <acc:AccountNo>02372591RURPRDC101</acc:AccountNo>
                <acc:Branch>M03</acc:Branch>
                <acc:CBAccountNo>40817810050450101811</acc:CBAccountNo>
                <acc:Ccy>RUR</acc:Ccy>
                <acc:CcyDigital>810</acc:CcyDigital>
                <acc:Status>C</acc:Status>
                <acc:CustomerNo>02372591</acc:CustomerNo>
                <acc:Special>PRDC1</acc:Special>
                <acc:OpenDate>2017-02-15</acc:OpenDate>
                <acc:AltAccountNo>02372591RURPRDC101</acc:AltAccountNo>
                <acc:Type>S</acc:Type>
                <acc:ATMAvailable>Y</acc:ATMAvailable>
                <acc:IsDormant>N</acc:IsDormant>
                <acc:PostAllowed>N</acc:PostAllowed>
                <acc:CreditTransAllowed>Y</acc:CreditTransAllowed>
                <acc:DebitTransAllowed>Y</acc:DebitTransAllowed>
                <acc:ClearingBank>042202799</acc:ClearingBank>
                <acc:CorBank>042202799</acc:CorBank>
                <acc:Positioning>
                    <acc:CBAccount>40817810050450101811</acc:CBAccount>
                    <acc:IMBAccountNo>40817810050450101811</acc:IMBAccountNo>
                    <acc:IMBBranch>M03</acc:IMBBranch>
                    <acc:HostABSAccountNo>02372591RURPRDC101</acc:HostABSAccountNo>
                    <acc:HostABSBranch>M03</acc:HostABSBranch>
                    <acc:HostABS>FCC</acc:HostABS>
                </acc:Positioning>
                <acc:MIS>
                    <acc:GroupComponent>R_P_MC</acc:GroupComponent>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS1</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS2</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS3</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS4</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS5</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS6</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS7</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS8</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS9</acc:Name>
                    </acc:TransactionClass>
                    <acc:TransactionClass>
                        <acc:Name>TXNMIS10</acc:Name>
                    </acc:TransactionClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS1</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS2</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS3</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS4</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS5</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS6</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS7</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS8</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS9</acc:Name>
                    </acc:CompositeClass>
                    <acc:CompositeClass>
                        <acc:Name>COMPMIS10</acc:Name>
                    </acc:CompositeClass>
                    <acc:CostCode>
                        <acc:Name>COSTCOD1</acc:Name>
                    </acc:CostCode>
                    <acc:CostCode>
                        <acc:Name>COSTCOD2</acc:Name>
                    </acc:CostCode>
                    <acc:CostCode>
                        <acc:Name>COSTCOD3</acc:Name>
                    </acc:CostCode>
                    <acc:CostCode>
                        <acc:Name>COSTCOD4</acc:Name>
                    </acc:CostCode>
                    <acc:CostCode>
                        <acc:Name>COSTCOD5</acc:Name>
                    </acc:CostCode>
                </acc:MIS>
                <acc:CloseDate>2017-11-22</acc:CloseDate>
                <acc:OpenBalance>0.00</acc:OpenBalance>
                <acc:CurrentBalance>0.00</acc:CurrentBalance>
                <acc:GWSAccType>CURR</acc:GWSAccType>
                <acc:OperationTypeCodes>VIEW=0,DOMPAY=1,CUPADE=0,CUPACO=0,</acc:OperationTypeCodes>
            </acc:AccountDetails>
        </acc:AccountList>
    </soapenv:Body>
</soapenv:Envelope>